using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using static System.Windows.Forms.VisualStyles.VisualStyleElement.Button;

namespace Kiosk
{
    public partial class Form1 : Form
    {

        #region 메뉴-분류 매핑 딕셔너리
        
        Dictionary<string, string> menuCategoryMap = new Dictionary<string, string>()
{
    // 1. 에이드/주스
    { "골드키위주스(ICE)", "에이드/주스" },
    { "꿀수박주스(ICE)", "에이드/주스" },
    { "딸기바나나주스(ICE)", "에이드/주스" },
    { "딸기주스(ICE)", "에이드/주스" },
    { "제로부스트에이드(ICE)", "에이드/주스" },
    { "피치 푸룬주스(ICE)", "에이드/주스" },

    // 2. 커피(아이스)
    { "라이트바닐라아몬드라떼", "커피(아이스)" },
    { "왕메가카페라떼", "커피(아이스)" },
    { "왕메가헛개리카노", "커피(아이스)" },
    { "왕할메가커피", "커피(아이스)" },
    { "콜드브루디카페인", "커피(아이스)" },
    { "콜드브루디카페인라떼", "커피(아이스)" },
    { "할메가미숫커피", "커피(아이스)" },
    { "할메가커피", "커피(아이스)" },
    { "헛개리카노", "커피(아이스)" },

    // 3. 커피(핫)
    { "콜드브루디카페인", "커피(핫)" },
    { "콜드브루디카페인라떼", "커피(핫)" },
    { "헛개리카노", "커피(핫)" },

    // 4. 디카페인
    { "디카페인꿀아메리카노(ICE)", "디카페인" },
    { "디카페인꿀아메리카노(HOT)", "디카페인" },
    { "디카페인라이트바닐라아몬드라떼(ICE)", "디카페인" },
    { "디카페인메가리카노(ICE)", "디카페인" },
    { "디카페인바닐라라떼(ICE)", "디카페인" },
    { "디카페인바닐라라떼(HOT)", "디카페인" },
    { "디카페인바닐라아메리카노(ICE)", "디카페인" },
    { "디카페인바닐라아메리카노(HOT)", "디카페인" },
    { "디카페인아메리카노(ICE)", "디카페인" },
    { "디카페인아메리카노(HOT)", "디카페인" },
    { "디카페인연유라떼(ICE)", "디카페인" },
    { "디카페인연유라떼(HOT)", "디카페인" },
    { "디카페인왕메가카페라떼(ICE)", "디카페인" },
    { "디카페인왕메가헛개리카노(ICE)", "디카페인" },
    { "디카페인카라멜마끼아또(ICE)", "디카페인" },
    { "디카페인카라멜마끼아또(HOT)", "디카페인" },
    { "디카페인카페라떼(ICE)", "디카페인" },
    { "디카페인카페라떼(HOT)", "디카페인" },
    { "디카페인카페모카(ICE)", "디카페인" },
    { "디카페인카페모카(HOT)", "디카페인" },
    { "디카페인카푸치노(ICE)", "디카페인" },
    { "디카페인카푸치노(HOT)", "디카페인" },
    { "디카페인헛개리카노(ICE)", "디카페인" },
    { "디카페인헛개리카노(HOT)", "디카페인" },
    { "디카페인헤이즐넛(ICE)", "디카페인" },
    { "디카페인헤이즐넛(HOT)", "디카페인" },
    { "디카페인헤이즐넛라떼(ICE)", "디카페인" },
    { "디카페인헤이즐넛라떼(HOT)", "디카페인" },

    // 5. 드링크
    { "고구마라떼(HOT)", "드링크" },
    { "고구마라떼(ICE)", "드링크" },
    { "곡물라떼(HOT)", "드링크" },
    { "곡물라떼(ICE)", "드링크" },
    { "녹차라떼(HOT)", "드링크" },
    { "로얄밀크티라떼(HOT)", "드링크" },
    { "오레오초코라떼(ICE)", "드링크" },
    { "왕메가초코(ICE)", "드링크" },
    { "토피넛라떼(HOT)", "드링크" },
    { "토피넛라떼(ICE)", "드링크" },
    { "핫초코(HOT)", "드링크" },
    { "흑당라떼(ICE)", "드링크" },
    { "흑당밀크티라떼(ICE)", "드링크" },
    { "흑당버블밀크티라떼(ICE)", "드링크" },

    // 6. 에스프레소
    { "디카페인에스프레소", "에스프레소" },
    { "에스프레소", "에스프레소" },
    { "에스프레소도피오", "에스프레소" },

    // 7. 스무디/프라페
    { "골드망고스무디", "스무디/프라페" },
    { "귤톡톡젤리스무디", "스무디/프라페" },
    { "꿀복숭아스무디", "스무디/프라페" },
    { "꿀수박화채스무디", "스무디/프라페" },
    { "딸기쿠키프라페", "스무디/프라페" },
    { "블루베리요거트스무디", "스무디/프라페" },
    { "코코넛커피스무디", "스무디/프라페" },
    { "쿠키프라페", "스무디/프라페" },

    // 8. 티
    { "상큼리치티(HOT)", "티" },
    { "상큼리치티(ICE)", "티" },
    { "왕메가아이스티(ICE)", "티" },
    { "저당POPPOP매실아이스티(ICE)", "티" },
    { "제로복숭아아이스티(ICE)", "티" },

};
        #endregion

        public Form1()
        {
            InitializeComponent();
        }


        private void Form1_Load(object sender, EventArgs e)
        {
     
        }
    }
}
